cfd/cases/leg_cur_U015_closed/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    cellDisplacement { solver PCG; preconditioner DIC; tolerance 1e-06; relTol 0; maxIter 100; }
    p       { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.01; }
    pFinal  { $p; relTol 0; }
    "(U|k|omega)"       { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-7; relTol 0.1; }
    "(U|k|omega)Final"  { $U; relTol 0; }
}
PIMPLE
{
    momentumPredictor   false;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    ddtCorr             true;
    correctPhi          false;
    oversetAdjustPhi    false;
    checkMeshCourantNo  yes;
}
relaxationFactors { equations { ".*" 1; } }
